[
  {
    "id": 1,
    "title": "Sube Landing Page",
    "description": "A modern landing page for a Sube Latinoamerica. An international fintech and E-commerce company.",
    "longDescription": "The landing page for Sube Latinoamerica is designed to provide a modern and engaging user experience. It features a clean and responsive design, showcasing the company's services and products effectively. The page includes sections for company information, services offered, customer testimonials, and a contact form. The use of vibrant colors and interactive elements helps to capture the attention of visitors and encourage them to explore further.",
    "imageUrl": "/assets/images/sube/sube-la.webp",
    "images": [
      "/assets/images/sube/sube-la.webp",
      "/assets/images/sube/sube-la-2.webp",
      "/assets/images/sube/sube-la-3.webp"
    ],
    "imagesMobile": [
      "/assets/images/sube/mobile/sube-la.webp",
      "/assets/images/sube/mobile/sube-la-2.webp",
      "/assets/images/sube/mobile/sube-la-3.webp"
    ],
    "externalLink": "https://sube.la/",
    "externalLinkText": null,
    "tags": [
      "Laravel",
      "Javascript",
      "Bootstrap",
      "Jquery",
      "Figma",
      "PHP",
      "Webpack",
      "GIT",
      "HTML",
      "CSS"
    ],
    "challenge": {
      "title": "The Challenge: Dynamic Component Reuse",
      "description": "The most difficult part was dynamically reusing existing components. This was achieved using Laravel Components, applying atomic principles so that sections such as `Partners` could vary depending on the context without duplicating code.",
      "solution": "Atomic Design & Laravel Blade Components"
    }
  },
  {
    "id": 2,
    "title": "E-commerce Sites for Sube",
    "description": "Dinamic site generation of webpages made by Sitebuilder, each costumer can create their own e-commerce website with a custom domain and hosting.",
    "longDescription": "Dinamic sites build by Sitebuilder, each costumer can create their own e-commerce website with a custom domain and hosting. The landing page for Sube Latinoamerica is designed to provide a modern and engaging user experience. It features a clean and responsive design, showcasing the company's services and products effectively. The page includes sections for company information, services offered, customer testimonials, and a contact form. The use of vibrant colors and interactive elements helps to capture the attention of visitors and encourage them to explore further.",
    "imageUrl": "/assets/images/sube/sube-sitios-2.webp",
    "images": [
      "/assets/images/sube/sube-sitios-2.webp",
      "/assets/images/sube/sube-sitios.webp",
      "/assets/images/sube/sube-sitios-3.webp",
      "/assets/images/sube/sube-sitios-4.webp"
    ],
    "imagesMobile": [
      "/assets/images/sube/mobile/sube-sitios-2.webp",
      "/assets/images/sube/mobile/sube-sitios.webp",
      "/assets/images/sube/mobile/sube-sitios-3.webp",
      "/assets/images/sube/mobile/sube-sitios-4.webp"
    ],
    "externalLink": "https://www.dleonhn.com/",
    "externalLinkText": "View live client site",
    "tags": [
      "Laravel",
      "Jquery",
      "Bootstrap",
      "Webpack",
      "PHP",
      "LESS",
      "AJAX/Fetch API",
      "GIT",
      "HTML",
      "CSS"
    ],
    "challenge": {
      "title": "Multi-Currency Synchronization & Real-Time Accuracy",
      "description": "The core challenge was ensuring 100% accuracy in currency conversion from local bank rates to USD, as public APIs often showed significant lags. We decoupled this logic into a dedicated Node.js and MongoDB microservice to fetch real-time bank data. In the Laravel backend, I implemented a centralized conversion layer within the Eloquent models to intercept and calculate values before final formatting.",
      "solution": "Node.js Microservice + Laravel Model Interceptors"
    }
  },
  {
    "id": 3,
    "title": "Sube Admin Panel",
    "description": "Admin panel for Sube Latinoamerica, where the company can manage all the content of the website and the e-commerce sites.",
    "longDescription": "The admin panel for Sube Latinoamerica is a comprehensive tool that allows the company to manage all the content of the website and the e-commerce sites. It features a clean and responsive design, providing an intuitive interface for managing users, products, website information, and orders. The panel includes sections for user management, product catalog management, website settings, and order tracking. The use of vibrant colors and interactive elements helps to capture the attention of administrators and encourage them to explore further.",
    "imageUrl": "/assets/images/sube/sube-panel-sitebuilder.webp",
    "images": [
      "/assets/images/sube/sube-panel-sitebuilder.webp",
      "/assets/images/sube/sube-panel-dashboard.webp",
      "/assets/images/sube/sube-panel-login.webp"
    ],
    "imagesMobile": [
      "/assets/images/sube/mobile/sube-panel.webp",
      "/assets/images/sube/mobile/sube-panel-2.webp",
      "/assets/images/sube/mobile/sube-panel-3.webp"
    ],
    "externalLink": "https://panel.sube.la",
    "externalLinkText": null,
    "tags": [
      "Angular",
      "TypeScript",
      "Bootstrap",
      "Webpack",
      "Node.js",
      "SCSS/SASS",
      "RxJS",
      "JWT",
      "GIT",
      "HTML",
      "CSS"
    ],
    "challenge": {
      "title": "Major Version Migration & Dependency Hell",
      "description": "The project involved migrating a legacy Angular application to a modern, stable version. This required a meticulous step-by-step upgrade path to maintain system integrity. The main difficulty lay in resolving cascading dependency failures, where libraries like Ngx-bootstrap and WYSIWYG editors required full reimplementation and API alignment to be compatible with the new Angular engine and modern build tools.",
      "solution": "Incremental Upgrade Strategy & Dependency Auditing"
    }
  },
  {
    "id": 4,
    "title": "RestAPI for Sube",
    "description": "REST API for Sube Latinoamerica, providing endpoints for managing users, products, website info, and orders.",
    "longDescription": "The REST API for Sube Latinoamerica is a robust backend service that provides endpoints for managing users, products, website information, and orders. It is built with Laravel and follows RESTful principles to ensure scalability and maintainability. The API supports authentication via JWT tokens and includes comprehensive documentation for developers.",
    "imageUrl": "/assets/images/sube/laravel_api.webp",
    "images": [
      "/assets/images/sube/laravel_api.webp",
      "/assets/images/sube/laravel_api_invoice.webp"
    ],
    "imagesMobile": [
      "/assets/images/sube/mobile/Laravel-API-mobile.webp",
      "/assets/images/sube/mobile/sube-api-mobile.webp"
    ],
    "externalLink": null,
    "externalLinkText": null,
    "tags": [
      "Laravel",
      "REST API",
      "PHP",
      "MySQL",
      "JWT",
      "Postman",
      "GIT",
      "Desing Patterns",
      "HTML",
      "CSS",
      "AWS"
    ],
    "challenge": {
      "title": "Cross-Border Fiscal Logic & Storage Optimization",
      "description": "The project required generating legal PDF invoices for multiple countries, each with unique tax laws, business rules, and document templates. To avoid a monolithic and unmaintainable codebase, I implemented the Strategy Design Pattern to decouple country-specific logic. Additionally, we optimized performance by implementing a 'Cloud-First' retrieval strategy: checking for existing documents in Amazon S3 before triggering a new generation process to reduce database and CPU overhead.",
      "solution": "Strategy Pattern + AWS S3 Versioning & Retrieval"
    }
  },
  {
    "id": 5,
    "title": "F.A.Q. Website for Honduran University",
    "description": "A responsive FAQ website for a Honduran University.",
    "longDescription": "The FAQ website for Honduran University is a responsive and accessible platform that provides quick answers to common questions. It features a clean and intuitive design, making it easy for students and staff to find the information they need. The site includes sections for frequently asked questions, departmental information, and contact details.",
    "imageUrl": "/assets/images/unah/unah.webp",
    "externalLink": null,
    "externalLinkText": null,
    "tags": [
      "Angular",
      "TypeScript",
      "Bootstrap",
      "Webpack",
      "Node.js",
      "Express",
      "RxJS",
      "JWT",
      "GIT",
      "HTML",
      "CSS"
    ],
    "challenge": {
      "title": "Stakeholder Communication & Requirements Alignment",
      "description": "As one of my first professional experiences during an internship, the main challenge was establishing a consistent and clear communication loop with the project leads. I had to learn how to translate academic requirements into technical tasks while managing expectations and deliverable timelines in a high-pressure institutional environment.",
      "solution": "Proactive Reporting & Iterative Feedback Loops"
    }
  },
  {
    "id": 6,
    "title": "Personal Portfolio",
    "description": "My personal portfolio website built with React & Tailwind CSS",
    "longDescription": "The personal portfolio website is a modern and responsive platform showcasing my skills, projects, and experience. It is built with React and Tailwind CSS, featuring a clean and intuitive design that highlights my work effectively. The site includes sections for my bio, projects, skills, and contact information.",
    "imageUrl": "/assets/images/personal/portfolio.webp",
    "imagesMobile": [
      "/assets/images/personal/mobile/portfolio.webp"
    ],
    "externalLink": null,
    "externalLinkText": null,
    "tags": [
      "React",
      "Tailwind CSS",
      "Vite",
      "Vercel",
      "Framer Motion",
      "GSAP",
      "GIT",
      "HTML",
      "CSS",
      "Vercel"
    ],
    "challenge": {
      "title": "Mastering React via Atomic Design Architecture",
      "description": "The main challenge was flattening the React learning curve while simultaneously implementing a strict Atomic Design methodology. Coming from an Angular background, I had to adapt to React's one-way data flow and hooks-based logic, ensuring that every component—from Atoms to Templates—remained pure, reusable, and decoupled according to SOLID principles.",
      "solution": "Atomic Design Pattern & Component-Driven Development"
    }
  },
  {
    "id": 7,
    "title": "MovieApp",
    "description": "A movie discovery application built with Angular and Bootstrap.",
    "longDescription": "The MovieApp is a responsive and interactive movie discovery application built with Angular and Bootstrap. It allows users to browse, search, and discover movies with detailed information. The app features a clean and intuitive interface, making it easy for users to find their favorite movies.",
    "imageUrl": "/assets/images/personal/movie-app.webp",
    "images": [
      "/assets/images/personal/movie-app.webp",
      "/assets/images/personal/movie-app-2.webp"
    ],
    "imagesMobile": [
      "/assets/images/personal/mobile/cinema-app.webp",
      "/assets/images/personal/mobile/cinema-app-2.webp"
    ],
    "externalLink": "https://teslawillow.github.io/MovieApp/home",
    "externalLinkText": "View demo",
    "tags": [
      "Angular",
      "Bootstrap",
      "TypeScript",
      "RxJS",
      "JWT",
      "Webpack",
      "GIT",
      "HTML",
      "CSS",
      "Heroku"
    ],
    "challenge": {
      "title": "Modular Architecture & Responsive Data Display",
      "description": "The primary challenge was building a scalable Angular application while avoiding 'spaghetti code' during my early learning phase. I focused on implementing a strictly modular architecture and a Mobile-First approach. This involved creating complex, touch-compatible carousel components for movie catalogs and ensuring efficient data binding across multiple views.",
      "solution": "Component-Based Architecture & Mobile-First Design"
    }
  }
]
