[
  {
    "id": 1,
    "title": "Sube Landing Page",
    "description": "A modern landing page for a Sube Latinoamerica. An international fintech and E-commerce company.",
    "longDescription": "The landing page for Sube Latinoamerica is designed to provide a modern and engaging user experience. It features a clean and responsive design, showcasing the company's services and products effectively. The page includes sections for company information, services offered, customer testimonials, and a contact form. The use of vibrant colors and interactive elements helps to capture the attention of visitors and encourage them to explore further.",
    "imageUrl": "/assets/images/sube/sube-la.webp",
    "externalLink": "https://sube.la/",
    "externalLinkText": null,
    "tags": ["Laravel", "Javascript", "Bootstrap", "Jquery", "Figma", "PHP", "Webpack", "GIT", "HTML", "CSS"]
  },
  {
    "id": 2,
    "title": "E-commerce Sites for Sube",
    "description": "Dinamic site generation of webpages made by Sitebuilder, each costumer can create their own e-commerce website with a custom domain and hosting.",
    "longDescription": "Dinamic sites build by Sitebuilder, each costumer can create their own e-commerce website with a custom domain and hosting. The landing page for Sube Latinoamerica is designed to provide a modern and engaging user experience. It features a clean and responsive design, showcasing the company's services and products effectively. The page includes sections for company information, services offered, customer testimonials, and a contact form. The use of vibrant colors and interactive elements helps to capture the attention of visitors and encourage them to explore further.",
    "imageUrl": "/assets/images/sube/sube-sitios-2.webp",
    "externalLink": "https://www.dleonhn.com/",
    "externalLinkText": "View live client site",
    "tags": ["Laravel", "Jquery", "Bootstrap", "Webpack", "PHP", "LESS", "AJAX/Fetch API", "GIT", "HTML", "CSS"]
  },
  {
    "id": 3,
    "title": "Sube Admin Panel",
    "description": "Admin panel for Sube Latinoamerica, where the company can manage all the content of the website and the e-commerce sites.",
    "longDescription": "The admin panel for Sube Latinoamerica is a comprehensive tool that allows the company to manage all the content of the website and the e-commerce sites. It features a clean and responsive design, providing an intuitive interface for managing users, products, website information, and orders. The panel includes sections for user management, product catalog management, website settings, and order tracking. The use of vibrant colors and interactive elements helps to capture the attention of administrators and encourage them to explore further.",
    "imageUrl": "/assets/images/sube/sube-panel-sitebuilder.webp",
    "externalLink": "https://panel.sube.la",
    "externalLinkText": null,
    "tags": ["Angular", "TypeScript", "Bootstrap", "Webpack", "Node.js", "SCSS/SASS", "RxJS", "JWT", "GIT", "HTML", "CSS"]
  },
  {
    "id": 4,
    "title": "RestAPI for Sube",
    "description": "REST API for Sube Latinoamerica, providing endpoints for managing users, products, website info, and orders.",
    "longDescription": "The REST API for Sube Latinoamerica is a robust backend service that provides endpoints for managing users, products, website information, and orders. It is built with Laravel and follows RESTful principles to ensure scalability and maintainability. The API supports authentication via JWT tokens and includes comprehensive documentation for developers.",
    "imageUrl": "/assets/images/sube/laravel_api.webp",
    "externalLink": null,
    "externalLinkText": null,
    "tags": ["Laravel", "REST API", "PHP", "MySQL", "JWT", "Postman", "GIT", "Desing Patterns", "HTML", "CSS"]
  },
  {
    "id": 5,
    "title": "F.A.Q. Website for Honduran University",
    "description": "A responsive FAQ website for a Honduran University.",
    "longDescription": "The FAQ website for Honduran University is a responsive and accessible platform that provides quick answers to common questions. It features a clean and intuitive design, making it easy for students and staff to find the information they need. The site includes sections for frequently asked questions, departmental information, and contact details.",
    "imageUrl": "/assets/images/unah/unah.webp",
    "externalLink": null,
    "externalLinkText": null,
    "tags": ["Angular", "TypeScript", "Bootstrap", "Webpack", "Node.js", "Express", "RxJS", "JWT", "GIT", "HTML", "CSS"]
  },
  {
    "id": 6,
    "title": "Personal Portfolio",
    "description": "My personal portfolio website built with React & Tailwind CSS",
    "longDescription": "The personal portfolio website is a modern and responsive platform showcasing my skills, projects, and experience. It is built with React and Tailwind CSS, featuring a clean and intuitive design that highlights my work effectively. The site includes sections for my bio, projects, skills, and contact information.",
    "imageUrl": "/assets/images/personal/portfolio.webp",
    "externalLink": null,
    "externalLinkText": null,
    "tags": ["React", "Tailwind CSS", "Vite", "Vercel", "Framer Motion", "GSAP", "GIT", "HTML", "CSS", "Vercel"]
  },
  {
    "id": 7,
    "title": "MovieApp",
    "description": "A movie discovery application built with Angular and Bootstrap.",
    "longDescription": "The MovieApp is a responsive and interactive movie discovery application built with Angular and Bootstrap. It allows users to browse, search, and discover movies with detailed information. The app features a clean and intuitive interface, making it easy for users to find their favorite movies.",
    "imageUrl": "/assets/images/personal/movie-app.webp",
    "externalLink": "https://teslawillow.github.io/MovieApp/home",
    "externalLinkText": "View demo",
    "tags": ["Angular", "Bootstrap", "TypeScript", "RxJS", "JWT", "Webpack", "GIT", "HTML", "CSS", "Heroku"]
  }
]